In [141]:
import numpy as np
import pandas as pd

In [142]:
serie = pd.Series([1, 2, 3, 4, 5], index = ["a", "b", "c", "d", "f"])
print(serie)

a    1
b    2
c    3
d    4
f    5
dtype: int64

In [143]:
dataFrame = pd.DataFrame({"var 1": serie, "var 2": serie})
print(dataFrame)

   var 1  var 2
a      1      1
b      2      2
c      3      3
d      4      4
f      5      5

In [144]:
serie["a"]

1

In [145]:
dataFrame["var 2"]

a    1
b    2
c    3
d    4
f    5
Name: var 2, dtype: int64

In [146]:
#existe la fila b?
print("b" in serie)

True

In [147]:
#existe la columna b?
print("b" in dataFrame)

False

In [148]:
dataFrame["var 2"] = [5, 6, 7, 8, 9]
print(dataFrame)

   var 1  var 2
a      1      5
b      2      6
c      3      7
d      4      8
f      5      9

In [149]:
print(serie)
print("")
#a serie quitarle "e"
del serie["a"]
print(serie)

a    1
b    2
c    3
d    4
f    5
dtype: int64

b    2
c    3
d    4
f    5
dtype: int64

In [150]:
serie = pd.Series([1, 2, 3, 4], index = ["a", "b", "c", "d"])
print(serie)

a    1
b    2
c    3
d    4
dtype: int64

In [151]:
dataFrame = pd.DataFrame({"var1": pd.Series(serie, dtype=np.int32), "var2": pd.Series(serie, dtype=np.string_)})
print(dataFrame)

   var1  var2
a     1  b'1'
b     2  b'2'
c     3  b'3'
d     4  b'4'

In [152]:
print(serie)

a    1
b    2
c    3
d    4
dtype: int64

In [153]:
print(serie + 2)

a    3
b    4
c    5
d    6
dtype: int64

In [154]:
print(dataFrame)

   var1  var2
a     1  b'1'
b     2  b'2'
c     3  b'3'
d     4  b'4'

In [155]:
print(dataFrame * 2)

   var1   var2
a     2  b'11'
b     4  b'22'
c     6  b'33'
d     8  b'44'

In [156]:
#indice a con indice a, indice z con indice z... etc
serie_uno = serie[:]
print(serie_uno)

a    1
b    2
c    3
d    4
dtype: int64

In [157]:
serie_uno["e"] = 7
print(serie_uno)

a    1
b    2
c    3
d    4
e    7
dtype: int64

In [158]:
dataFrame_uno =dataFrame
dataFrame_uno["var3"] = [1, 2, 3, 4]
print(dataFrame_uno)

   var1  var2  var3
a     1  b'1'     1
b     2  b'2'     2
c     3  b'3'     3
d     4  b'4'     4

In [159]:
print(serie + serie_uno)
#7 + algo que no se que es da un resultado desconocido

a    2.0
b    4.0
c    6.0
d    8.0
e    NaN
dtype: float64

In [160]:
print(dataFrame + dataFrame_uno)
#dataFrame_uno = dataFrame --> significa que son lo mismo, si se modifica uno se modifca el otro
#forma correcta es dataFrame_uno = dataFrame[:]

   var1   var2  var3
a     2  b'11'     2
b     4  b'22'     4
c     6  b'33'     6
d     8  b'44'     8

In [161]:
print(dataFrame)
print("")
print(dataFrame.T)

   var1  var2  var3
a     1  b'1'     1
b     2  b'2'     2
c     3  b'3'     3
d     4  b'4'     4

         a     b     c     d
var1     1     2     3     4
var2  b'1'  b'2'  b'3'  b'4'
var3     1     2     3     4

In [162]:
#operaciones basicas 2

In [163]:
#seleccionar por indice
serie = pd.Series([1, 2, 3, 4, 5], index = ["a", "b", "c", "d", "e"])
print(serie.a)

1

In [164]:
dataFrame = pd.DataFrame(np.arange(4).reshape(2, 2), index = ["1)", "2)"], columns = ["a", "b"])
print(dataFrame)

    a  b
1)  0  1
2)  2  3

In [165]:
·seleccionar la columna con indice a
dataFrame.a

SyntaxError: invalid character '·' (U+00B7) (675068743.py, line 1)

In [166]:
serie[0]

1

In [167]:
dataFrame["a"]

1)    0
2)    2
Name: a, dtype: int32

In [168]:
print("")
serie.loc["a"]
print("")
print(serie.loc["a":"b"])
print("")
print(serie.loc[["a", "b"]])

a    1
b    2
dtype: int64

a    1
b    2
dtype: int64

In [169]:
#fila 1), columna a
dataFrame.loc["1)", "a"]

0

In [170]:
serie.iloc[2]

3

In [171]:
dataFrame.iloc[1, 1]

3

In [172]:
peliculas = pd.DataFrame({
    "Valoracion": [6, None, 8.75, None],
    "Presupuesto": [160, 250, 100, None],
    "Director": ["Peter Jackson", "Garet Edwards", "Martin Scorsese", "Alfonso Cuaron"]
}, index = [[2014, 2014, 2013, 2013], ["Godzilla", "El Hobbit III", "El Lobo de Wall Street", "Gravity"]])
print(peliculas)

                             Valoracion  Presupuesto         Director
2014 Godzilla                      6.00        160.0    Peter Jackson
     El Hobbit III                  NaN        250.0    Garet Edwards
2013 El Lobo de Wall Street        8.75        100.0  Martin Scorsese
     Gravity                        NaN          NaN   Alfonso Cuaron

In [173]:
print(peliculas.loc[(2014, "Godzilla")])

Valoracion               6.0
Presupuesto            160.0
Director       Peter Jackson
Name: (2014, Godzilla), dtype: object

In [174]:
#puso una fila de index en columns
p2 = peliculas.unstack()
print(p2)

        Valoracion                                           Presupuesto  \
     El Hobbit III El Lobo de Wall Street Godzilla Gravity El Hobbit III
2013           NaN                   8.75      NaN     NaN           NaN
2014           NaN                    NaN      6.0     NaN         250.0

                                                   Director  \
     El Lobo de Wall Street Godzilla Gravity  El Hobbit III
2013                  100.0      NaN     NaN            NaN
2014                    NaN    160.0     NaN  Garet Edwards


     El Lobo de Wall Street       Godzilla         Gravity
2013        Martin Scorsese            NaN  Alfonso Cuaron
2014                    NaN  Peter Jackson             NaN

In [175]:
p2 = p2.stack()
print(p2)

                             Valoracion  Presupuesto         Director
2013 El Lobo de Wall Street        8.75        100.0  Martin Scorsese
     Gravity                        NaN          NaN   Alfonso Cuaron
2014 El Hobbit III                  NaN        250.0    Garet Edwards
     Godzilla                      6.00        160.0    Peter Jackson

In [176]:
p2 = p2.unstack()
print(p2)

        Valoracion                                           Presupuesto  \
     El Hobbit III El Lobo de Wall Street Godzilla Gravity El Hobbit III
2013           NaN                   8.75      NaN     NaN           NaN
2014           NaN                    NaN      6.0     NaN         250.0

                                                   Director  \
     El Lobo de Wall Street Godzilla Gravity  El Hobbit III
2013                  100.0      NaN     NaN            NaN
2014                    NaN    160.0     NaN  Garet Edwards


     El Lobo de Wall Street       Godzilla         Gravity
2013        Martin Scorsese            NaN  Alfonso Cuaron
2014                    NaN  Peter Jackson             NaN

In [177]:
series = pd.Series([1, 2, 3, 4], index = ["a", "b", "c", "d"])
print(series)

a    1
b    2
c    3
d    4
dtype: int64

In [178]:
df = pd.DataFrame(np.arange(16).reshape(4, 4), index = ["f1", "f2", "f3", "f4"])
print(df)

     0   1   2   3
f1   0   1   2   3
f2   4   5   6   7
f3   8   9  10  11
f4  12  13  14  15

In [179]:
#invertir serie
series.reindex(["d", "c", "b", "a"])

d    4
c    3
b    2
a    1
dtype: int64

In [180]:
series.reindex(["d", "c", "e", "a", "b"])

d    4.0
c    3.0
e    NaN
a    1.0
b    2.0
dtype: float64

In [181]:
series.reindex(["e", "a", "d", "c", "b"], fill_value = 0)

e    0
a    1
d    4
c    3
b    2
dtype: int64

In [182]:
df.reindex(["f1", "f3"])

    0  1   2   3
f1  0  1   2   3
f3  8  9  10  11

In [183]:
df.reindex(["f1", "f3", "f6"])

      0    1     2     3
f1  0.0  1.0   2.0   3.0
f3  8.0  9.0  10.0  11.0
f6  NaN  NaN   NaN   NaN

In [184]:
print(df)
#los indices sos strings por lo que f10 toma los valores de su siguiente (f3--> 1, 10, 3 --> f1 < f10 < f3 --> orden alfabetico)
df.reindex(["f1", "f3", "f10"], method = "ffill")

     0   1   2   3
f1   0   1   2   3
f2   4   5   6   7
f3   8   9  10  11
f4  12  13  14  15

     0  1   2   3
f1   0  1   2   3
f3   8  9  10  11
f10  0  1   2   3

In [185]:
df.reindex(["f1", "f3", "f10"], method = "bfill")

     0  1   2   3
f1   0  1   2   3
f3   8  9  10  11
f10  4  5   6   7

In [186]:
df.reindex(columns = [0, 3, 10], method = "ffill")

    0   3   10
f1   0   3   3
f2   4   7   7
f3   8  11  11
f4  12  15  15

In [187]:
#pasar el index a columna
df.reset_index()

  index   0   1   2   3
0    f1   0   1   2   3
1    f2   4   5   6   7
2    f3   8   9  10  11
3    f4  12  13  14  15

In [188]:
#convertir la columna 3 en index
df.set_index([3])

     0   1   2
3
3    0   1   2
7    4   5   6
11   8   9  10
15  12  13  14

In [189]:
#pivot tables

In [190]:
peliculas = pd.DataFrame({"Año": [2014, 2014, 2013, 2013, 2011],
                         "Valoracion": [6, None, 8.75, None, 8.9],
                         "Director": ["Grant Edwards", "Peter Jackson", "Martin Scorsese", "Alfonso Cuaron", "Peter Jackson"],
                         "Titulo": ["Godzilla", "El Hobbit III", "El Lobo de Wall Street", "Gravity", "Lord of the ring"]}
)
print(peliculas)

    Año  Valoracion         Director                  Titulo
0  2014        6.00    Grant Edwards                Godzilla
1  2014         NaN    Peter Jackson           El Hobbit III
2  2013        8.75  Martin Scorsese  El Lobo de Wall Street
3  2013         NaN   Alfonso Cuaron                 Gravity
4  2011        8.90    Peter Jackson        Lord of the ring

In [191]:
#Filas: Año, Columnas: Director, Valores: Titulo
peliculas.pivot("Año", "Director", "Titulo")
#se creo una tabla que muestra el titulo de la pelicula que saco cada director en cada año

Director,Alfonso Cuaron,Grant Edwards,Martin Scorsese,Peter Jackson
Año,,,,
2011,NaN,NaN,NaN,Lord of the ring
2013,Gravity,NaN,El Lobo de Wall Street,NaN
2014,NaN,Godzilla,NaN,El Hobbit III

In [192]:
#las peliculas cuyo año son 2011 las cambiamos por 2014
peliculas.loc[peliculas["Año"] == 2011, "Año"] = 2014
print(peliculas)

    Año  Valoracion         Director                  Titulo
0  2014        6.00    Grant Edwards                Godzilla
1  2014         NaN    Peter Jackson           El Hobbit III
2  2013        8.75  Martin Scorsese  El Lobo de Wall Street
3  2013         NaN   Alfonso Cuaron                 Gravity
4  2014        8.90    Peter Jackson        Lord of the ring

In [193]:
peliculas = pd.DataFrame({"Año": [2014, 2014, 2013, 2013, 2011],
                         "Valoracion": [6, None, 8.75, None, 8.9],
                         "Presupuesto": [160, 250, 100, None, None],
                         "Director": ["Grant Edwards", "Peter Jackson", "Martin Scorsese", "Alfonso Cuaron", "Peter Jackson"],
                         "Titulo": ["Godzilla", "El Hobbit III", "El Lobo de Wall Street", "Gravity", "Lord of the ring"]}
)
print(peliculas)

    Año  Valoracion  Presupuesto         Director                  Titulo
0  2014        6.00        160.0    Grant Edwards                Godzilla
1  2014         NaN        250.0    Peter Jackson           El Hobbit III
2  2013        8.75        100.0  Martin Scorsese  El Lobo de Wall Street
3  2013         NaN          NaN   Alfonso Cuaron                 Gravity
4  2011        8.90          NaN    Peter Jackson        Lord of the ring

In [194]:
#Filas: Año, Columnas: Director, Valores: Titulo, Agregado: suma
pd.pivot_table(peliculas, values = "Presupuesto", index = ["Director"], columns = ["Año"], aggfunc = np.sum)
#aca creamos una tabla donde se muestra cuanto gano cada director en cada año y si gano dinero de dos peliculas o mas se suman

Año              2011   2013   2014
Director
Alfonso Cuaron    NaN    0.0    NaN
Grant Edwards     NaN    NaN  160.0
Martin Scorsese   NaN  100.0    NaN
Peter Jackson     0.0    NaN  250.0

In [199]:
serie = pd.Series(np.arange(10, 20), index = ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j"])
print(serie)

a    10
b    11
c    12
d    13
e    14
f    15
g    16
h    17
i    18
j    19
dtype: int32

In [196]:
dataFrame = pd.DataFrame(np.arange(16).reshape(4, 4), index = ["f1", "f2", "f3", "f4"], columns = ["c1", "c2", "c3", "c4"])
print(dataFrame)

    c1  c2  c3  c4
f1   0   1   2   3
f2   4   5   6   7
f3   8   9  10  11
f4  12  13  14  15

In [201]:
print(serie.drop("a"))

b    11
c    12
d    13
e    14
f    15
g    16
h    17
i    18
j    19
dtype: int32

In [203]:
print(dataFrame.drop("f1"))

    c1  c2  c3  c4
f2   4   5   6   7
f3   8   9  10  11
f4  12  13  14  15

In [206]:
print(dataFrame.drop("c2", axis = 1))

    c1  c3  c4
f1   0   2   3
f2   4   6   7
f3   8  10  11
f4  12  14  15

In [207]:
#aritmetica

In [208]:
serie1 = pd.Series([1, 2, 3, 4], index = ["a", "b", "c", "d"])
print(serie1)
serie2 = pd.Series([5, 6, 7, 8], index = ["c", "d", "e", "f"])
print(serie2)

a    1
b    2
c    3
d    4
dtype: int64
c    5
d    6
e    7
f    8
dtype: int64

In [209]:
#suma
serie1 + serie2

a     NaN
b     NaN
c     8.0
d    10.0
e     NaN
f     NaN
dtype: float64

In [210]:
serie1.add(serie2)

a     NaN
b     NaN
c     8.0
d    10.0
e     NaN
f     NaN
dtype: float64

In [211]:
serie1.add(serie2, fill_value = 0)

a     1.0
b     2.0
c     8.0
d    10.0
e     7.0
f     8.0
dtype: float64

In [212]:
serie1.sub(serie2, fill_value = 0)

a    1.0
b    2.0
c   -2.0
d   -2.0
e   -7.0
f   -8.0
dtype: float64

In [213]:
serie1.mul(serie2, fill_value = 0)

a     0.0
b     0.0
c    15.0
d    24.0
e     0.0
f     0.0
dtype: float64

In [214]:
sr = pd.Series([3, 2, 1, 4], index = ["d", "a", "c", "b"])
print(sr)

d    3
a    2
c    1
b    4
dtype: int64

In [217]:
sr.sort_index()

a    2
b    4
c    1
d    3
dtype: int64

In [218]:
sr.sort_index(ascending = False)

d    3
c    1
b    4
a    2
dtype: int64

In [219]:
sr.sort_values()

c    1
a    2
d    3
b    4
dtype: int64

In [221]:
dataFrame = pd.DataFrame(np.arange(16).reshape(4, 4), index = ["f3", "f1", "f4", "f2"], columns = ["c3", "c1", "c4", "c2"])
print(dataFrame)

    c3  c1  c4  c2
f3   0   1   2   3
f1   4   5   6   7
f4   8   9  10  11
f2  12  13  14  15

In [222]:
dataFrame.sort_index()

    c3  c1  c4  c2
f1   4   5   6   7
f2  12  13  14  15
f3   0   1   2   3
f4   8   9  10  11

In [223]:
dataFrame.sort_index(ascending = False)

    c3  c1  c4  c2
f4   8   9  10  11
f3   0   1   2   3
f2  12  13  14  15
f1   4   5   6   7

In [226]:
dataFrame.sort_values(["f1"], axis = 1)

    c3  c1  c4  c2
f3   0   1   2   3
f1   4   5   6   7
f4   8   9  10  11
f2  12  13  14  15

In [227]:
dataFrame.sort_values(["c1"])

    c3  c1  c4  c2
f3   0   1   2   3
f1   4   5   6   7
f4   8   9  10  11
f2  12  13  14  15

In [228]:
serie = pd.Series(np.arange(100))
print(serie)

0      0
1      1
2      2
3      3
4      4
      ..
95    95
96    96
97    97
98    98
99    99
Length: 100, dtype: int32

In [236]:
df = pd.DataFrame(np.arange(100).reshape(10, 10))
print(df)

    0   1   2   3   4   5   6   7   8   9
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99

In [237]:
serie.head()

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [238]:
serie.head(3)

0    0
1    1
2    2
dtype: int32

In [239]:
serie.tail()

95    95
96    96
97    97
98    98
99    99
dtype: int32

In [240]:
serie.tail(3)

97    97
98    98
99    99
dtype: int32

In [241]:
df.head()

    0   1   2   3   4   5   6   7   8   9
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49

In [242]:
df.head(3)

    0   1   2   3   4   5   6   7   8   9
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29

In [244]:
df.tail()

    0   1   2   3   4   5   6   7   8   9
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99

In [246]:
df.tail(3)

    0   1   2   3   4   5   6   7   8   9
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99